#<unknown instruction>
lui $17 0x8000 #correct
addiu $16 $0 0x000AA #correct
addiu $17 $17 0x00004 #correct
sw $17 0x0003($16) #未检查 这条指令的翻译对吗 信号是对的
jal 0x0000000a #测 #MemToReg有問題 去掉两条指令后变成0x0000007
#sll $0 $0 0x00000 #nop 后面开始指令全是32'h0的问题在于rom写错了
sll $4 $17 0x00004 #h00112100
sra $5 $17 0x00003 #h001128C3
or $17 $4 $17 #h02748825
add $17 $4 $17 #$19>$20 $17=0 h02748820
sw $17 0x0003($16) #hAE110003
slt $17 $19 $20 #h0274882A
beq $0 $17 0x00001 #应该跳过下一条 h10110001 确实跳过了
sub $17 $4 $5
sub $17 $5 $4
lw $20 0x0003($16)
j 0x00000001
